{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/google/imagenet/resnet_v2_50/feature_vector/4"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": true, "label_smoothing": 0.1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.004999999888241291, "decay": 0.0, "momentum": 0.8999999761581421, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of23.bin", "group1-shard2of23.bin", "group1-shard3of23.bin", "group1-shard4of23.bin", "group1-shard5of23.bin", "group1-shard6of23.bin", "group1-shard7of23.bin", "group1-shard8of23.bin", "group1-shard9of23.bin", "group1-shard10of23.bin", "group1-shard11of23.bin", "group1-shard12of23.bin", "group1-shard13of23.bin", "group1-shard14of23.bin", "group1-shard15of23.bin", "group1-shard16of23.bin", "group1-shard17of23.bin", "group1-shard18of23.bin", "group1-shard19of23.bin", "group1-shard20of23.bin", "group1-shard21of23.bin", "group1-shard22of23.bin", "group1-shard23of23.bin"], "weights": [{"name": "dense/kernel", "shape": [2048, 3], "dtype": "float32"}, {"name": "dense/bias", "shape": [3], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/weights", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/weights", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/weights", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/biases", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/preact/beta", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/weights", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/preact/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/weights", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/biases", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/weights", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/preact/gamma", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/biases", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/preact/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/weights", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/weights", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/preact/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/preact/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv3/biases", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/shortcut/weights", "shape": [1, 1, 1024, 2048], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/postnorm/beta", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/preact/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/biases", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/preact/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/preact/beta", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/biases", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv3/biases", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/preact/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/biases", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/weights", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/postnorm/gamma", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/shortcut/weights", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/weights", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv3/biases", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/biases", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/weights", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv3/weights", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/biases", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/weights", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv3/weights", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/preact/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv3/weights", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/preact/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv3/biases", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv3/weights", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv3/weights", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "resnet_v2_50/conv1/biases", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/weights", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/preact/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/preact/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/preact/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/weights", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/shortcut/biases", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/preact/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/weights", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/preact/gamma", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/preact/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/weights", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/preact/gamma", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/weights", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/preact/gamma", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/weights", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/weights", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "resnet_v2_50/conv1/weights", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv3/weights", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/weights", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/preact/gamma", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv3/biases", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/preact/beta", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/weights", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/shortcut/weights", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/weights", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/preact/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/preact/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/preact/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/preact/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/preact/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/preact/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/preact/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/preact/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/postnorm/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/preact/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/preact/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/preact/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/preact/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_5/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/preact/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_2/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/preact/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/preact/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_3/bottleneck_v2/preact/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_4/bottleneck_v2/preact/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/preact/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv2/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/preact/moving_mean", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_2/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_4/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/preact/moving_variance", "shape": [2048], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_1/bottleneck_v2/preact/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "resnet_v2_50/block1/unit_1/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/preact/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_1/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_2/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_6/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_3/bottleneck_v2/conv2/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block4/unit_2/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "resnet_v2_50/block3/unit_3/bottleneck_v2/conv1/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "resnet_v2_50/block2/unit_3/bottleneck_v2/conv1/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "resnet_v2_50/postnorm/moving_mean", "shape": [2048], "dtype": "float32"}]}]}